tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf84_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF84_H_
#define _PIC16LF84_H_

#define STATUS                        0
#define C                             1
#define CARRY                         2
#define DC                            3
#define ZERO                          4
#define Z                             5
#define nPD                           6
#define nTO                           7
#define RP0                           8
#define RP                            9
#define RP1                           10
#define IRP                           11
#define PORTA                         12
#define RA0                           13
#define RA1                           14
#define RA2                           15
#define RA3                           16
#define RA4                           17
#define PORTB                         18
#define RB0                           19
#define RB1                           20
#define RB2                           21
#define RB3                           22
#define RB4                           23
#define RB5                           24
#define RB6                           25
#define RB7                           26
#define PCLATH                        27
#define INTCON                        28
#define RBIF                          29
#define INTF                          30
#define T0IF                          31
#define TMR0IF                        32
#define RBIE                          33
#define INTE                          34
#define T0IE                          35
#define TMR0IE                        36
#define EEIE                          37
#define GIE                           38
#define OPTION_REG                    39
#define PS                            40
#define PS0                           41
#define PS1                           42
#define PS2                           43
#define PSA                           44
#define T0SE                          45
#define T0CS                          46
#define INTEDG                        47
#define nRBPU                         48
#define TRISA                         49
#define TRISA0                        50
#define TRISA1                        51
#define TRISA2                        52
#define TRISA3                        53
#define TRISA4                        54
#define TRISB                         55
#define TRISB0                        56
#define TRISB1                        57
#define TRISB2                        58
#define TRISB3                        59
#define TRISB4                        60
#define TRISB5                        61
#define TRISB6                        62
#define TRISB7                        63
#define EECON1                        64
#define RD                            65
#define WR                            66
#define WREN                          67
#define WRERR                         68
#define EEIF                          69

#endif // _PIC16LF84_H_
